{
  "basics": {
    "name": "Adam Graham",
    "label": "Computer Science Student",
    "picture": "../img/adam-headshot.JPG",
    "email": "adamgra@hawaii.edu",
    "phone": "",
    "website": "https://usradam.github.io",
    "summary": "I am a senior at the University of Hawaii at Mānoa pursuing a B.S. in Computer Science and a B.A. in Spanish & Latin American Studies. I am currently an intern for the Griffiss Institute as a VICEROY MAVEN intern, where I work as a government contractor for SMX, helping to build open-source intelligence tools. I was recently a Software Test Engineer Intern for GenPF, a startup developing an AI-powered co-pilot for investment management.",
    "location": { "address": "", "postalCode": "", "city": "Honolulu", "countryCode": "", "region": "Hawaii" },
    "profiles": [
      { "network": "github", "username": "usradam", "url": "http://github.com/usradam" },
      { "network": "linkedin", "username": "adamgra", "url": "http://linkedin.com/in/adamgra" }
    ]
  },
  "interests": [
    { "name": "Software Engineering" },
    { "name": "Data Visualization" },
    { "name": "Web Development" },
    { "name": "Cybersecurity" }
  ],
  "skills": [
    {
      "name": "Programming Languages",
      "keywords": [ " JavaScript/TypeScript", "HTML/CSS", "C", "Python", "Java" ]
    },
    {
      "name": "Frameworks/Libraries",
      "keywords": [ "Next.js", "Bootstrap", "React" ]
    },
    {
      "name": "Developer Tools",
      "keywords": [ "GitHub", "VS Code", "Vi", "Jupyter Notebook", "IntelliJ", "CLion", "Eclipse", "FileZilla", "PuTTY", "Docker" ]
    }
  ],
  "education": [
    {
      "institution": "University of Hawaii at Mānoa, Honolulu, HI",
      "area": "Computer Science",
      "studyType": "B.S.",
      "startDate": "2021-08-23",
      "endDate": "2026-05",
      "courses": [
      ]
    },
    {
      "institution": "University of Hawaii at Mānoa, Honolulu, HI",
      "area": "Spanish & Latin American Studies",
      "studyType": "B.A.",
      "startDate": "2021-08-23",
      "endDate": "2026-05",
      "courses": [
      ]
    }
  ],
  "work": [
    {
      "company": "Griffiss Institute",
      "position": "VICEROY MAVEN Intern",
      "website": "",
      "startDate": "2025-06-16",
      "endDate": "2025-07-31",
      "summary": "",
      "highlights": [
        "Intern for the VICEROY program, hosted by the Pacific Intelligence and Innovation Initiative (P3I), assigned to DoD contractor SMX",
        "Developed a system block diagram outlining open-source intelligence (OSINT) data functions and anomaly detection processes that utilizes AWS",
        "Developed a flexible Python script to dynamically parse and extract data from JSON files within a subdirectory",
        "Built Python scripts to ingest, process, analyze, and visualize maritime API data from an open-source automatic identification system (AIS) vendor",
        "Enhanced SMX’s Elevate Intelligence, Surveillance, and Reconnaissance (EISR) platform by leveraging entity resolution software to identify relationships across data at rest and API data"
      ]
    },
    {
      "company": "GenPF",
      "position": "Software Test Engineer Intern",
      "website": "",
      "startDate": "2025-01-06",
      "endDate": "2025-05-09",
      "summary": "",
      "highlights": [
        "Perform quality assurance for GenPF, a startup developing an AI-powered co-pilot for investment management",
        "Conduct manual tests to validate software functionality and ensure a high-quality user experience",
        "Develop and implement automated tests for APIs and browser functionality to optimize software performance",
        "Create detailed, actionable bug reports to expedite software fixes",
        "Design use cases to showcase software capabilities for client demonstrations and promotional materials",
        "Utilize Python to clean, organize, and convert over 2,600 CSV files into PKL format for seamless data integration"
      ]
    },
    {
      "company": "University of Hawaii at Mānoa",
      "position": "Microfilm Preservation Assistant",
      "website": "",
      "startDate": "2022-03-08",
      "endDate": "2025-05-09",
      "summary": "",
      "highlights": [
        "Collate hundreds of newspapers, ensuring accurate data organization for multiple titles to streamline future access and retrieval",
        "Coordinate the preparation of computer-generated targets for microfilming, collaborating with the vendor to ensure on-time project delivery",
        "Prepare and ship newspaper boxes with data to the vendor, ensuring timely and efficient processing of materials",
        "Perform quality control on microfilm shipments, cross-referencing data to ensure accuracy and meet contract deadlines",
        "Onboard and train students in microfilm processes, providing instruction and support"
      ]
    }
  ],
  "awards": [
    {
      "title": "Academic Excellence Award ",
      "date": "Awarded May 2025",
      "awarder": "University of Hawaii at Mānoa",
      "summary": "I have been awarded the Academic Excellence Award from the Spanish, Portuguese & LAIS Division, Department of Languages and Literatures of Europe and the Americas. I was awarded this scholarship based on my academic achievements and the following criteria: classified student enrolled at UHM, GPA of 3.5 or higher, and majoring in the LLEA BA: Spanish & LAIS program"
    },
    {
      "title": "Linda Rudoy Memorial Spanish Scholarship Endowment",
      "date": "Awarded December 2024",
      "awarder": "University of Hawaii at Mānoa",
      "summary": "The purpose of this Fund is to assist undergraduate or graduate students seeking a degree in Spanish at the University of Hawai'i at Manoa College of Languages, Linguistics and Literatures of Europe and the Americas. Funds are intended for costs related to attendance and overseas study as approved by the Spanish Division."
    },
    {
      "title": "Mānoa Academic Merit Scholarship",
      "date": "Awarded August 2021",
      "awarder": "University of Hawaii at Mānoa",
      "summary": "The Mānoa Academic Merit Scholarship is an automatic scholarship for first-time, degree-seeking students who enroll at UH Mānoa the following Fall semester after high school graduation and have demonstrated outstanding academic achievement. Students must be enrolled for a full-time course load of UH Mānoa credits."
    },
    {
      "title": "Chenter Foundation Susana & Jorge Ho Next Steps Scholarship",
      "date": "Awarded July 2021",
      "awarder": "University of Hawaii Foundation",
      "summary": "The purpose of this Fund is to provide scholarship support to students enrolled at any University of Hawaii campus. Funds shall be used for costs associated with attendance (e.g. tuition, books, fees, etc.)."
    },
    {
      "title": "University of Hawaii at Mānoa Dean's List",
      "date": "",
      "awarder": "University of Hawaii at Mānoa",
      "summary": "Undergraduate students are awarded the Dean’s List distinction if they: (1) earn a semester grade point average of 3.5 or higher based on 12 credits or more taken for a grade (C/NC courses do not count), and (2) do not receive grades of W, I, F, or NC for that semester."
    }
  ],
  "references": [
    {
      "name": "Available upon request"
    }
  ]
}
